# Data Analysis -1
* Objective: To find relationship between realstae market price and initial sales price (Seoul APT)
* Data Source: Korean Public Data Portal
    https://www.data.go.kr/index.do
* Data Information
 - Initial Sales Pice (2019)
 - Initial Sales Price (2013 ~ 2018)

## Data Load
###  Initial Sales price in 2019

In [8]:
# Pandas library is used for data load
import pandas as pd

In [9]:
# Loaded data is set to variable df_last
# encoding="cp949" used for Korean
df_last = pd.read_csv("C:/Users/taehe/Desktop/Python/jupyter-tutorial/data/주택도시보증공사_전국 평균 분양가격(2019년 12월).csv", encoding="cp949")

#read row, column
df_last.shape

(4335, 5)

In [10]:
# Preview of data with head
df_last.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [11]:
# Preview of data with tail
df_last.tail()

     지역명               규모구분    연도   월 분양가격(㎡)
4330  제주                 전체  2019  12    3882
4331  제주         전용면적 60㎡이하  2019  12     NaN
4332  제주   전용면적 60㎡초과 85㎡이하  2019  12    3898
4333  제주  전용면적 85㎡초과 102㎡이하  2019  12     NaN
4334  제주        전용면적 102㎡초과  2019  12    3601

### Sales Price 2013~2018

In [12]:
# Loaded data is set to variable df_first
# encoding="cp949" used for Korean
df_first = pd.read_csv("C:/Users/taehe/Desktop/Python/jupyter-tutorial/data/전국 평균 분양가격(2013년 9월부터 2015년 8월까지).csv", encoding="cp949")

#read row, column
df_last.shape

(4335, 5)

In [13]:
# Preview of data with head
df_first.head()

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
0,서울,18189,17925,17925,18016,18098,19446,18867,18742,19274,...,20242,20269,20670,20670,19415,18842,18367,18374,18152,18443
1,부산,8111,8111,9078,8965,9402,9501,9453,9457,9411,...,9208,9208,9204,9235,9279,9327,9345,9515,9559,9581
2,대구,8080,8080,8077,8101,8267,8274,8360,8360,8370,...,8439,8253,8327,8416,8441,8446,8568,8542,8542,8795
3,인천,10204,10204,10408,10408,10000,9844,10058,9974,9973,...,10020,10020,10017,9876,9876,9938,10551,10443,10443,10449
4,광주,6098,7326,7611,7346,7346,7523,7659,7612,7622,...,7752,7748,7752,7756,7861,7914,7877,7881,8089,8231

In [14]:
# Preview of data with tail
df_first.tail()

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
12,전북,6282,6281,5946,5966,6277,6306,6351,6319,6436,...,6583,6583,6583,6583,6542,6551,6556,6601,6750,6580
13,전남,5678,5678,5678,5696,5736,5656,5609,5780,5685,...,5768,5784,5784,5833,5825,5940,6050,6243,6286,6289
14,경북,6168,6168,6234,6317,6412,6409,6554,6556,6563,...,6881,6989,6992,6953,6997,7006,6966,6887,7035,7037
15,경남,6473,6485,6502,6610,6599,6610,6615,6613,6606,...,7125,7332,7592,7588,7668,7683,7717,7715,7723,7665
16,제주,7674,7900,7900,7900,7900,7900,7914,7914,7914,...,7724,7739,7739,7739,7826,7285,7285,7343,7343,7343

### Data Summary - 2019

In [15]:
df_last.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4335 entries, 0 to 4334
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4335 non-null   object
 1   규모구분     4335 non-null   object
 2   연도       4335 non-null   int64
 3   월        4335 non-null   int64
 4   분양가격(㎡)  4058 non-null   object
dtypes: int64(2), object(3)
memory usage: 169.5+ KB

### Missing Value - 2019

In [16]:
# True == 1 False == 0
df_last.isnull()

        지역명   규모구분     연도      월  분양가격(㎡)
0     False  False  False  False    False
1     False  False  False  False    False
2     False  False  False  False    False
3     False  False  False  False    False
4     False  False  False  False    False
...     ...    ...    ...    ...      ...
4330  False  False  False  False    False
4331  False  False  False  False     True
4332  False  False  False  False    False
4333  False  False  False  False     True
4334  False  False  False  False    False

[4335 rows x 5 columns]

In [17]:
# Missing Value
df_last.isnull().sum()

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    277
dtype: int64

In [18]:
# Missing Value by isna()
df_last.isna().sum()

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    277
dtype: int64

## Data Processing
### Change Data Type - 2019
object to int

In [19]:
# 1 .astype(int) makes error due to empty string
# df_last["분양가격(㎡)"].astype(int)

# 2 pd.to_numberic() makes error due to empty string
#pd.to_numeric(df_last["분양가격(㎡)"])

# 3. add errors='coerce' 
df_last["분양가격"] = pd.to_numeric(df_last["분양가격(㎡)"], errors='coerce')

# 4 Now we can use this value as float type data
df_last["분양가격"]

0       5841.0
1       5652.0
2       5882.0
3       5721.0
4       5879.0
         ...
4330    3882.0
4331       NaN
4332    3898.0
4333       NaN
4334    3601.0
Name: 분양가격, Length: 4335, dtype: float64

### Calculate Sales Price / 3.3 m2 
for 2019 data

In [20]:
df_last["평당분양가격"] = df_last["분양가격"] * 3.3

# new column is added in the end
df_last.head(1)

  지역명 규모구분    연도   월 분양가격(㎡)    분양가격   평당분양가격
0  서울   전체  2015  10    5841  5841.0  19275.3

### Summarize Sales Price / 3.3m2

In [22]:
# .info() delivers brief information about Initial Sales Price
df_last.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4335 entries, 0 to 4334
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4335 non-null   object
 1   규모구분     4335 non-null   object
 2   연도       4335 non-null   int64
 3   월        4335 non-null   int64
 4   분양가격(㎡)  4058 non-null   object
 5   분양가격     3957 non-null   float64
 6   평당분양가격   3957 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 237.2+ KB

In [24]:
# Summarize column initial price/ m2 (before change data type -object)
df_last["분양가격(㎡)"].describe()

count     4058
unique    1753
top       2221
freq        17
Name: 분양가격(㎡), dtype: object

In [26]:
# Summarized altered column initial price / m2 (after change data type to float)
df_last["분양가격"].describe()

count     3957.000000
mean      3238.128633
std       1264.309933
min       1868.000000
25%       2441.000000
50%       2874.000000
75%       3561.000000
max      12728.000000
Name: 분양가격, dtype: float64

Summarize of using describe()
* count : the number of count are different in object type and float type due to NaN values
* unique : usually used for String data to see the number of categories
* top : only in object. The most frequently appeard object
* freq : how many times top data appears

* std (standard deviation)
* 25% : 1/4 
* 50% : median
* 75% : 3/4

Important to notice that
* max is way much higher than 75%
* gap between mean and median is caused by max

### Change Column Name (규모구분 to 전용면적) - 2019
규모구분 컬럼에는 전용면적에 대한 내용이 있다. 전용면적이라는 문구가 공통적으로 들어가고 규모구분보다는 전용면적이 좀 더 직관적이기 때문에 전용면적이라는 컬럼을 새로 만들어주고 기존 규모구분의 값에서 전용면적 초과,이하 등의 문구를 빼고 간결하게 만든다. 

More intuitive value for APT size using existing column (규모구분)

In [30]:
# .unique() returns the unique value from given column
df_last["규모구분"].unique()

array(['전체', '전용면적 60㎡이하', '전용면적 60㎡초과 85㎡이하', '전용면적 85㎡초과 102㎡이하',
       '전용면적 102㎡초과'], dtype=object)

In [40]:
# .replace() applies to exactly same string only
# .str.replace() applies to string includes given requirement

# replace not important string from column for better memory mgmt and set it to new variable
df_last["전용면적"] = df_last["규모구분"].str.replace("전용면적","")
df_last["전용면적"] = df_last["전용면적"].str.replace("초과","~")
df_last["전용면적"] = df_last["전용면적"].str.replace("이하", "~")
df_last["전용면적"] = df_last["전용면적"].str.replace(" ", "").str.strip()
df_last["전용면적"]

0              전체
1            60㎡~
2        60㎡~85㎡~
3       85㎡~102㎡~
4           102㎡~
          ...
4330           전체
4331         60㎡~
4332     60㎡~85㎡~
4333    85㎡~102㎡~
4334        102㎡~
Name: 전용면적, Length: 4335, dtype: object

### Removing unrelated Columns - 2019

In [44]:
# Check column names
df_last.head

  지역명 규모구분    연도   월 분양가격(㎡)    분양가격   평당분양가격 전용면적
0  서울   전체  2015  10    5841  5841.0  19275.3   전체

In [54]:
# check memory usage is 271.1 KB
df_last.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4335 entries, 0 to 4334
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4335 non-null   object
 1   규모구분     4335 non-null   object
 2   연도       4335 non-null   int64
 3   월        4335 non-null   int64
 4   분양가격(㎡)  4058 non-null   object
 5   분양가격     3957 non-null   float64
 6   평당분양가격   3957 non-null   float64
 7   전용면적     4335 non-null   object
dtypes: float64(2), int64(2), object(4)
memory usage: 271.1+ KB

In [55]:
# Drop unnessary columns using .drop()
# axis: 0 - row , 1 - column
df_last = df_last.drop(["규모구분", "분양가격(㎡)"], axis=1)

In [61]:
# Check 
df_last.head(1)

  지역명    연도   월    분양가격   평당분양가격 전용면적
0  서울  2015  10  5841.0  19275.3   전체

In [60]:
# Check Memory : 203 KB
df_last.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4335 entries, 0 to 4334
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지역명     4335 non-null   object
 1   연도      4335 non-null   int64
 2   월       4335 non-null   int64
 3   분양가격    3957 non-null   float64
 4   평당분양가격  3957 non-null   float64
 5   전용면적    4335 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 203.3+ KB

It is important to remove unncessary String in column and columns for better memory mgmgt.

## Data Aggregation